#!/bin/sh


#----------------------------------------------------------
#parser_string.sh
#Created by Leo Wen on 2017-07-03
#----------------------------------------------------------

#----------------------------------------------------------
#字符串截取
#----------------------------------------------------------

var=http://www.aaa.com/123.htm
echo ${var}
# #（＃＃）:号截取，删除左边字符，保留右边字符
echo ${var#*//}
echo ${var##*//}

# %(%%)号截取，删除右边字符，保留左边字符
echo ${var%/*}
echo ${var%%/12*}

# 从左边第几个字符开始，及字符的个数
echo ${var:7:11}

# 从左边第几个字符开始，一直到结束
echo ${var:7}

# 从右边第几个字符开始，及之后字符的个数
echo ${var:0-7:3}
echo ${var:0-7}

#字符串拼接
name="leo"
echo "hello ${name}"
echo ${#name}       #字符串长度
echo ${name:1:3}    #提取子字符串
